{
    "class_name": "Sequential",
    "config": [{
        "class_name": "Convolution2D",
        "config": {
            "W_regularizer": null,
            "border_mode": "same",
            "nb_row": 3,
            "name": "convolution2d_1",
            "nb_col": 3,
            "b_constraint": null,
            "bias": true,
            "input_dtype": "float32",
            "activity_regularizer": null,
            "dim_ordering": "th",
            "W_constraint": null,
            "batch_input_shape": [
                null,
                3,
                32,
                32
            ],
            "activation": "linear",
            "init": "glorot_uniform",
            "b_regularizer": null,
            "trainable": true,
            "subsample": [
                1,
                1
            ],
            "nb_filter": 32
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_1",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "Dropout",
        "config": {
            "name": "dropout_1",
            "p": 0.2,
            "trainable": true
        }
    }, {
        "class_name": "Convolution2D",
        "config": {
            "W_regularizer": null,
            "border_mode": "same",
            "nb_row": 3,
            "nb_col": 3,
            "b_constraint": null,
            "bias": true,
            "W_constraint": null,
            "activity_regularizer": null,
            "dim_ordering": "th",
            "b_regularizer": null,
            "activation": "linear",
            "init": "glorot_uniform",
            "name": "convolution2d_2",
            "trainable": true,
            "subsample": [
                1,
                1
            ],
            "nb_filter": 32
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_2",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "MaxPooling2D",
        "config": {
            "pool_size": [
                2,
                2
            ],
            "border_mode": "valid",
            "dim_ordering": "th",
            "strides": [
                2,
                2
            ],
            "name": "maxpooling2d_1",
            "trainable": true
        }
    }, {
        "class_name": "Convolution2D",
        "config": {
            "W_regularizer": null,
            "border_mode": "same",
            "nb_row": 3,
            "nb_col": 3,
            "b_constraint": null,
            "bias": true,
            "W_constraint": null,
            "activity_regularizer": null,
            "dim_ordering": "th",
            "b_regularizer": null,
            "activation": "linear",
            "init": "glorot_uniform",
            "name": "convolution2d_3",
            "trainable": true,
            "subsample": [
                1,
                1
            ],
            "nb_filter": 64
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_3",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "Dropout",
        "config": {
            "name": "dropout_2",
            "p": 0.2,
            "trainable": true
        }
    }, {
        "class_name": "Convolution2D",
        "config": {
            "W_regularizer": null,
            "border_mode": "same",
            "nb_row": 3,
            "nb_col": 3,
            "b_constraint": null,
            "bias": true,
            "W_constraint": null,
            "activity_regularizer": null,
            "dim_ordering": "th",
            "b_regularizer": null,
            "activation": "linear",
            "init": "glorot_uniform",
            "name": "convolution2d_4",
            "trainable": true,
            "subsample": [
                1,
                1
            ],
            "nb_filter": 64
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_4",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "MaxPooling2D",
        "config": {
            "pool_size": [
                2,
                2
            ],
            "border_mode": "valid",
            "dim_ordering": "th",
            "strides": [
                2,
                2
            ],
            "name": "maxpooling2d_2",
            "trainable": true
        }
    }, {
        "class_name": "Convolution2D",
        "config": {
            "W_regularizer": null,
            "border_mode": "same",
            "nb_row": 3,
            "nb_col": 3,
            "b_constraint": null,
            "bias": true,
            "W_constraint": null,
            "activity_regularizer": null,
            "dim_ordering": "th",
            "b_regularizer": null,
            "activation": "linear",
            "init": "glorot_uniform",
            "name": "convolution2d_5",
            "trainable": true,
            "subsample": [
                1,
                1
            ],
            "nb_filter": 128
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_5",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "Dropout",
        "config": {
            "name": "dropout_3",
            "p": 0.2,
            "trainable": true
        }
    }, {
        "class_name": "Convolution2D",
        "config": {
            "W_regularizer": null,
            "border_mode": "same",
            "nb_row": 3,
            "nb_col": 3,
            "b_constraint": null,
            "bias": true,
            "W_constraint": null,
            "activity_regularizer": null,
            "dim_ordering": "th",
            "b_regularizer": null,
            "activation": "linear",
            "init": "glorot_uniform",
            "name": "convolution2d_6",
            "trainable": true,
            "subsample": [
                1,
                1
            ],
            "nb_filter": 128
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_6",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "MaxPooling2D",
        "config": {
            "pool_size": [
                2,
                2
            ],
            "border_mode": "valid",
            "dim_ordering": "th",
            "strides": [
                2,
                2
            ],
            "name": "maxpooling2d_3",
            "trainable": true
        }
    }, {
        "class_name": "Flatten",
        "config": {
            "name": "flatten_1",
            "trainable": true
        }
    }, {
        "class_name": "Dropout",
        "config": {
            "name": "dropout_4",
            "p": 0.2,
            "trainable": true
        }
    }, {
        "class_name": "Dense",
        "config": {
            "W_regularizer": null,
            "bias": true,
            "b_constraint": null,
            "output_dim": 1024,
            "W_constraint": {
                "m": 3,
                "name": "MaxNorm",
                "axis": 0
            },
            "activity_regularizer": null,
            "input_dim": null,
            "activation": "linear",
            "init": "glorot_uniform",
            "name": "dense_1",
            "trainable": true,
            "b_regularizer": null
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_7",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "Dropout",
        "config": {
            "name": "dropout_5",
            "p": 0.2,
            "trainable": true
        }
    }, {
        "class_name": "Dense",
        "config": {
            "W_regularizer": null,
            "bias": true,
            "b_constraint": null,
            "output_dim": 512,
            "W_constraint": {
                "m": 3,
                "name": "MaxNorm",
                "axis": 0
            },
            "activity_regularizer": null,
            "input_dim": null,
            "activation": "linear",
            "init": "glorot_uniform",
            "name": "dense_2",
            "trainable": true,
            "b_regularizer": null
        }
    }, {
        "class_name": "LeakyReLU",
        "config": {
            "name": "leakyrelu_8",
            "trainable": true,
            "alpha": 0.15
        }
    }, {
        "class_name": "Dropout",
        "config": {
            "name": "dropout_6",
            "p": 0.5,
            "trainable": true
        }
    }, {
        "class_name": "Dense",
        "config": {
            "W_regularizer": null,
            "bias": true,
            "b_constraint": null,
            "output_dim": 10,
            "W_constraint": null,
            "activity_regularizer": null,
            "input_dim": null,
            "activation": "softmax",
            "init": "glorot_uniform",
            "name": "dense_3",
            "trainable": true,
            "b_regularizer": null
        }
    }],
    "keras_version": "1.1.2"
}
